a5021/stm32-async-1wire/src/ds18b20.c
#include "ds18b20.h"
#include "macro.h"
#include "stm32f1xx.h"

/**
 * @defgroup DS18B20_Private_Types DS18B20 Private Types
 * @{
 */

/**
 * @defgroup DS18B20_Private_Constants DS18B20 Private Constants
 * @{
 */

/** @brief Timer configuration for 1µs resolution (PSC = SYSCLK / 1MHz - 1) */
#ifdef HSI_8MHZ
#define TIM_PRESCALER 7 // 8MHz / 8 = 1MHz → 1µs/tick
#else
#define TIM_PRESCALER 71 // 72MHz / 72 = 1MHz → 1µs/tick
#endif
/** @brief Minimum reset pulse duration in microseconds */
#define RESET_PULSE_MIN 480U
/** @brief Maximum reset pulse duration in microseconds */
#define RESET_PULSE_MAX 540U
/** @brief Minimum presence pulse positive width in microseconds */
#define POSITIVE_WIDTH_MIN 15U
/** @brief Maximum presence pulse positive width in microseconds */
#define POSITIVE_WIDTH_MAX 60U
/** @brief Minimum presence pulse negative width in microseconds */
#define NEGATIVE_WIDTH_MIN 60U
/** @brief Maximum presence pulse negative width in microseconds */
#define NEGATIVE_WIDTH_MAX 240U
/** @brief Calculated minimum presence pulse timing */
#define PRESENCE_PULSE_MIN (RESET_PULSE_MIN + POSITIVE_WIDTH_MIN + NEGATIVE_WIDTH_MIN)
/** @brief Calculated maximum presence pulse timing */
#define PRESENCE_PULSE_MAX (RESET_PULSE_MAX + POSITIVE_WIDTH_MAX + NEGATIVE_WIDTH_MAX)
/** @brief Duration to drive bus low during reset in microseconds */
#define RESET_PULSE_DURATION RESET_PULSE_MIN
/** @brief Total reset timeslot timeout in microseconds */
#define RESET_TIMEOUT (RESET_PULSE_MIN * 2)
/** @brief CRC8 polynomial for DS18B20 scratchpad validation (Dallas/Maxim algorithm) */
#define DS18B20_CRC8_POLY 0x8C
/** @brief Number of bytes to include in CRC calculation */
#define DS18B20_CRC8_BYTES 8
/** @brief Size of edge capture buffer for presence detection */
#define CAPTURE_BUF_SIZE 2
/** @brief Duration of '1' bit pulse in microseconds */
#define ONE_PULSE 5
/** @brief Duration of '0' bit pulse in microseconds */
#define ZERO_PULSE 60
/** @brief Guard band between slots to prevent overlap due to bus rise time and DMA latency */
#define GUARD_BAND 5
/** @brief Number of bits in a byte */
#define DS18B20_BITS_PER_BYTE 8
/** @brief Total length of DS18B20 scratchpad in bytes */
#define DS18B20_SCRATCHPAD_LEN 9
/** @brief Total number of bits in DS18B20 scratchpad */
#define DS18B20_SCRATCHPAD_BITS (DS18B20_SCRATCHPAD_LEN * DS18B20_BITS_PER_BYTE)
/** @brief Total number of bits in a device ROM address */
#define DS18B20_ROM_BITS (DS18B20_ROM_BYTES * DS18B20_BITS_PER_BYTE)
/** @brief DS18B20 1-Wire command codes (internal protocol details) */
#define DS18B20_SEARCH_ROM 0xF0 /**< Search ROM */
#define DS18B20_MATCH_ROM 0x55 /**< Match ROM */
#define DS18B20_READ_SCRATCHPAD 0xBE /**< Read Scratchpad */
#define DS18B20_CONVERT_T 0x44 /**< Convert T */
/** @brief Total slots for Match ROM + 8-byte ROM + command */
#define DS18B20_MATCH_SLOTS ((DS18B20_ROM_BYTES + 2) * DS18B20_BITS_PER_BYTE)
/** @brief Slots for the invariant Match ROM + 8-byte ROM prefix (built on select) */
#define DS18B20_PREFIX_SLOTS ((DS18B20_ROM_BYTES + 1) * DS18B20_BITS_PER_BYTE)
/** @brief Threshold to distinguish short/long pulses (10µs) */
#define SHORT_PULSE_MAX 10U
/** @brief Number of DMA transfers for command transmission (2 bytes × 8 bits) */
#define DS18B20_DMA_TRANSFERS (2 * DS18B20_BITS_PER_BYTE)
/** @brief DMA channel control bits for 16-bit capture: MINC | PSIZE_0 | EN */
#define DS18B20_DMA_CCR_CAPTURE (DMA_CCR_MINC | DMA_CCR_PSIZE_0 | DMA_CCR_EN)
/** @brief Timer configuration for wait and pause (ARR, RCR) — 62500 ticks @ 1µs = 62.5ms per period */
#define PAUSE_750MS 62500, 11 /**< 750ms delay for temperature conversion (62.5ms × 12) */
#define PAUSE_5S 62500, 79 /**< 5s pause between measurement cycles (62.5ms × 80) */

/**
 * @brief Convert byte bit to pulse duration (ONE_PULSE µs for '1', ZERO_PULSE µs for '0')
 * @param B Byte value
 * @param N Bit position (0-7)
 * @return Pulse duration in microseconds
 */
#define B2P(B, N) (((B) & (1 << (N))) ? ONE_PULSE : ZERO_PULSE)

/**
 * @brief Convert entire byte to sequence of pulse durations for transmission
 * @param B Byte value to convert
 */
#define BYTE_TO_PULSES(B)                       \
    B2P(B, 0), B2P(B, 1), B2P(B, 2), B2P(B, 3), \
        B2P(B, 4), B2P(B, 5), B2P(B, 6), B2P(B, 7)

/** @brief DS18B20 Convert T command sequence in pulse duration format */
static const uint8_t conv_cmd[] = {BYTE_TO_PULSES(0xCC), BYTE_TO_PULSES(0x44)};

/** @brief DS18B20 Read Scratchpad command sequence in pulse duration format */
static const uint8_t read_cmd[] = {BYTE_TO_PULSES(0xCC), BYTE_TO_PULSES(0xBE)};

/**
 * @brief Force timer update event and wait for update flag - used for timer initialization
 * @param T Timer register structure
 */
#define FORCE_UPDATE_EVENT(T)   \
    do {                        \
        (T).EGR = TIM_EGR(UG);  \
        __DSB();                \
        (T).SR &= ~TIM_SR(UIF); \
    } while (0)

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Types DS18B20 Private Types
 * @{
 */

/**
 * @brief DS18B20 driver context structure using union for memory efficiency
 * @note Different stages of communication use the same memory for different purposes
 */
typedef struct {
    /**
     * @brief Union overlay for memory efficiency
     * @warning CRITICAL INVARIANT: scratchpad[n] aliases pulse[n] (same byte).
     *          decode_scratchpad() MUST read all 8 bits of pulse[byte*8..byte*8+7]
     *          BEFORE writing scratchpad[byte]. Reordering loops will corrupt bytes 0-8.
     */
    union {
        volatile uint16_t edge[DS18B20_SCRATCHPAD_BITS / 2]; /**< Edge timestamps for presence detection */
        volatile uint8_t pulse[DS18B20_SCRATCHPAD_BITS]; /**< Pulse durations for data decoding */
        uint8_t scratchpad[DS18B20_SCRATCHPAD_LEN]; /**< Sensor scratchpad data */
        uint64_t fill_union; /**< Utility field for filling the union */
    };
    uint8_t current_state; /**< Current state of the state machine */
    uint8_t address_mode; /**< 0 = Skip ROM (all devices), non-zero = Match ROM */
    uint8_t selected_rom[DS18B20_ROM_BYTES]; /**< ROM of the selected device */
    uint8_t addr_cmd[DS18B20_MATCH_SLOTS]; /**< Pulse buffer for Match ROM command */
} DS18B20_ctx_t;

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Variables DS18B20 Private Variables
 * @{
 */

/** @brief Global driver context instance */
static DS18B20_ctx_t ctx;

/**
 * @}
 */

/**
 * @defgroup DS18B20_Private_Functions DS18B20 Private Functions
 * @{
 */

/**
 * @brief Default weak implementation for busy indicator (e.g. LED toggling during measurement)
 * @param[in] action 0 = idle, non-zero = busy
 */
__WEAK void ds18b20_busy(unsigned action) {
    (void)action;
    // Default implementation - empty (no LED control)
}

/**
 * @brief Default weak implementation for measurement completion callback
 * @param[in] temp_tenths Temperature value in tenths of degrees Celsius, or error code
 */
__WEAK void ds18b20_complete(int16_t temp_tenths) {
    (void)temp_tenths;
    // Default implementation - empty (no temperature handling)
}

/**
 * @brief Calculate Dallas/Maxim CRC-8 over a byte buffer
 * @param[in] data Input buffer
 * @param[in] len Number of bytes to process
 * @return CRC-8 checksum value
 */
uint8_t ds18b20_crc8(const uint8_t* data, uint8_t len) {
    uint8_t crc = 0;
    // Process each byte in the buffer
    for (uint8_t i = 0; i < len; i++) {
        uint8_t inByte = data[i];
        // Process each bit in the byte using Dallas/Maxim CRC8 algorithm
        for (uint8_t b = 0; b < DS18B20_BITS_PER_BYTE; b++) {
            uint8_t mix = (crc ^ inByte) & 0x01;
            crc >>= 1;
            if (mix) crc ^= DS18B20_CRC8_POLY;
            inByte >>= 1;
        }
    }
    return crc;
}

/**
 * @brief Calculate CRC8 checksum for DS18B20 scratchpad data validation
 * @return CRC8 checksum value
 */
__STATIC_FORCEINLINE uint8_t check_scratchpad_crc(void) {
    return ds18b20_crc8(ctx.scratchpad, DS18B20_CRC8_BYTES);
}

/**
 * @brief Decode pulse durations into scratchpad bytes using bit timing analysis
 * @note Branchless implementation: accumulates bits into native-width variable,
 *       then writes once per byte. Relies on union aliasing invariant — see DS18B20_ctx_t.
 */
__STATIC_FORCEINLINE void decode_scratchpad(void) {
    for (unsigned byte = 0; byte < DS18B20_SCRATCHPAD_LEN; ++byte) {
        const unsigned base = byte * DS18B20_BITS_PER_BYTE;
        unsigned value = 0;
        for (unsigned bit = 0; bit < DS18B20_BITS_PER_BYTE; ++bit) {
            value |= (unsigned)(ctx.pulse[base + bit] <= SHORT_PULSE_MAX) << bit;
        }
        ctx.scratchpad[byte] = (uint8_t)value;
    }
}

/**
 * @brief Convert raw temperature data from scratchpad to tenths of degrees Celsius
 * @return Temperature value in tenths of degrees Celsius
 */
__STATIC_FORCEINLINE int16_t decode_temperature(void) {
    // Combine LSB and MSB of temperature register (bytes 0 and 1)
    int16_t raw = (int16_t)((ctx.scratchpad[1] << 8) | ctx.scratchpad[0]);
    // Convert to tenths of degrees Celsius (raw value in 1/16th degrees)
    // Multiply by 10 then divide by 16 to get value in tenths of degree
    return (raw * 10) / 16;
}

/**
 * @brief Verify presence of DS18B20 sensor by checking reset pulse timing
 * @return 1 if device present, 0 if no device detected
 */
__STATIC_FORCEINLINE unsigned check_presence(void) {
    uint16_t reset = ctx.edge[0];
    uint16_t presence = ctx.edge[1];
    // Validate that reset pulse duration is within specification
    // and presence pulse timing indicates a responding device
    return (reset >= RESET_PULSE_MIN) && (reset <= RESET_PULSE_MAX) &&
           (presence >= PRESENCE_PULSE_MIN) && (presence <= PRESENCE_PULSE_MAX);
}

/**
 * @brief Start timer with specified period and repetition count for precise timing
 * @param[in] arr Auto-reload register value
 * @param[in] rcr Repetition counter value
 */
__STATIC_FORCEINLINE void start_timer(uint16_t arr, uint8_t rcr) {
    T1.ARR = arr;
    T1.RCR = rcr;
    // Force update event to load new values
    FORCE_UPDATE_EVENT(T1);
    // Start timer in One Pulse Mode (OPM) - runs once then stops
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Wait for temperature conversion to complete (750ms typical)
 * @note Non-blocking - starts timer that will generate update event when complete
 */
__STATIC_FORCEINLINE void wait_conversion(void) { start_timer(PAUSE_750MS); }

/**
 * @brief Start inter-measurement pause period (5s)
 * @note Non-blocking - starts timer for inter-measurement delay
 */
__STATIC_FORCEINLINE void start_cycle_pause(void) { start_timer(PAUSE_5S); }

/**
 * @brief Configure timer and DMA for capture operation
 * @param[out] dst Destination buffer for captured data
 * @param[in] count Number of transfers
 * @param[in] width DMA transfer width: 8 for 8-bit, 16 for 16-bit
 */
__STATIC_FORCEINLINE void arm_capture(volatile void *dst, uint16_t count, uint16_t width) {
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2, OC1PE, CC2S_1, IC2F_0, IC2F_1, IC2F_2);
    T1.CCER = TIM_CCER(CC1E, CC2E);
    T1.DIER = TIM_DIER(CC2DE);
    FORCE_UPDATE_EVENT(T1);
    T1.CCR1 = 0;
    D13.CCR = 0;
    D13.CPAR = (uint32_t)&T1.CCR2;
    D13.CMAR = (uint32_t)dst;
    D13.CNDTR = count;
    D13.CCR = DS18B20_DMA_CCR_CAPTURE | ((width == 16) ? DMA_CCR_MSIZE_0 : 0);
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Initialize 1-Wire bus reset sequence using timer and DMA
 */
__STATIC_FORCEINLINE void reset_bus(void) {
    T1.RCR = 0;
    T1.ARR = RESET_TIMEOUT;
    T1.CCR1 = RESET_PULSE_DURATION;
    arm_capture((volatile void *)ctx.edge, CAPTURE_BUF_SIZE, 16);
}

/**
 * @brief Transmit a command sequence of arbitrary length to DS18B20 using DMA
 * @param[in] cmd Pointer to command sequence in pulse duration format
 * @param[in] slots Number of bit slots (bits) to transmit
 * @note Non-blocking - configures hardware to transmit command automatically.
 */
__STATIC_FORCEINLINE void send_command_n(const uint8_t* cmd, uint16_t slots) {
    T1.RCR = slots - 1;
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND;
    T1.CCR1 = cmd[0];
    T1.CCR4 = ONE_PULSE + ZERO_PULSE;
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2);
    T1.CCER = TIM_CCER(CC1E);
    T1.DIER = TIM_DIER(CC4DE);
    FORCE_UPDATE_EVENT(T1);
    D14.CCR = 0;
    D14.CPAR = (uint32_t)&T1.CCR1;
    D14.CMAR = (uint32_t)&cmd[1];
    D14.CNDTR = slots - 1;
    D14.CCR = DMA_CCR(DIR, MINC, PSIZE_0, EN);
    T1.CR1 = TIM_CR1(OPM, CEN);
}

/**
 * @brief Transmit a two-byte command sequence (Skip ROM + command) using DMA
 * @param[in] cmd Pointer to command sequence in pulse duration format
 * @note Non-blocking - configures hardware to transmit command automatically
 */
__STATIC_FORCEINLINE void send_command(const uint8_t* cmd) {
    send_command_n(cmd, DS18B20_DMA_TRANSFERS);
}

/**
 * @brief Encode a byte into pulse durations (ONE_PULSE for '1', ZERO_PULSE for '0')
 * @param[out] out Output buffer (8 entries)
 * @param[in] byte Byte value to encode
 */
__STATIC_FORCEINLINE void encode_byte_pulses(uint8_t* out, uint8_t byte) {
    for (uint8_t i = 0; i < DS18B20_BITS_PER_BYTE; i++) {
        out[i] = (byte & (1u << i)) ? (uint8_t)ONE_PULSE : (uint8_t)ZERO_PULSE;
    }
}

/**
 * @brief Build the invariant Match ROM prefix (0x55 + selected ROM)
 * @note Fills the first DS18B20_PREFIX_SLOTS entries of ctx.addr_cmd.
 *       The prefix depends only on the selected device, so it is built
 *       once in ds18b20_select() and reused for every command.
 */
__STATIC_FORCEINLINE void build_addr_prefix(void) {
    uint8_t* p = ctx.addr_cmd;
    encode_byte_pulses(p, DS18B20_MATCH_ROM);
    p += DS18B20_BITS_PER_BYTE;
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        encode_byte_pulses(p, ctx.selected_rom[i]);
        p += DS18B20_BITS_PER_BYTE;
    }
}

/**
 * @brief Append one command byte to the pre-built Match ROM prefix
 * @param[in] cmd_byte Command byte to send after the ROM address
 * @note Requires build_addr_prefix() to have been called for the current
 *       selected device. Only the last byte (8 slots) is re-encoded per call.
 */
__STATIC_FORCEINLINE void build_addr_cmd(uint8_t cmd_byte) {
    encode_byte_pulses(&ctx.addr_cmd[DS18B20_PREFIX_SLOTS], cmd_byte);
}

/**
 * @brief Read scratchpad data from DS18B20 using timer capture and DMA
 * @note Non-blocking - configures hardware to capture data automatically
 */
__STATIC_FORCEINLINE void read_data(void) {
    T1.RCR = DS18B20_SCRATCHPAD_BITS - 1;
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND;
    T1.CCR1 = ONE_PULSE;
    arm_capture((volatile void *)ctx.pulse, DS18B20_SCRATCHPAD_BITS, 8);
}

/**
 * @}
 */

/**
 * @defgroup DS18B20_Bus DS18B20 Internal 1-Wire Bus Primitives
 * @brief Private non-blocking 1-Wire bus primitives used by the measurement
 *        state machine and the built-in device search. Each function only
 *        schedules a hardware-timed operation on TIM1/DMA and returns
 *        immediately. They are internal to the driver and not exposed to the
 *        application.
 * @{
 */

/**
 * @brief Schedule a 1-Wire bus reset (presence pulse captured via DMA)
 */
static void ds18b20_bus_reset(void) { reset_bus(); }

/**
 * @brief Non-blocking completion check for the scheduled bus operation
 * @return 1 if finished (update flag cleared), 0 while still running
 */
static uint8_t ds18b20_bus_done(void) {
    if (T1.SR & TIM_SR(UIF)) {
        T1.SR = 0;
        return 1u;
    }
    return 0u;
}

/**
 * @brief Check presence of the last scheduled bus reset
 * @return 1 if at least one device answered, 0 otherwise
 */
static uint8_t ds18b20_bus_present(void) { return (uint8_t)check_presence(); }

/**
 * @brief Encode a byte into pulse durations (ONE_PULSE for '1', ZERO_PULSE for '0')
 * @param[out] out Output buffer (8 entries)
 * @param[in] byte Byte value to encode
 */
static void ds18b20_bus_encode_byte(uint8_t* out, uint8_t byte) {
    encode_byte_pulses(out, byte);
}

/**
 * @brief Schedule a write of `slots` bit slots
 * @note Non-blocking: configures the hardware and returns. The pulses buffer
 *       must stay valid until ds18b20_bus_done() reports completion, since
 *       the DMA feeds CCR1 from it (except for a single slot, written directly).
 */
static void ds18b20_bus_write_slots(const uint8_t* pulses, uint16_t slots) {
    if (slots == 1) {
        // Single slot: no DMA needed, avoids a zero-length DMA transaction
        T1.RCR = 0; // Single slot, no repetition
        T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND; // Total bit slot time
        T1.CCR1 = pulses[0]; // Pulse duration encodes the bit
        // Configure channel 1 for output compare (drive bus low during the pulse)
        T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2);
        T1.CCER = TIM_CCER(CC1E); // Enable output compare
        T1.DIER = 0; // No DMA for a single bit slot
        FORCE_UPDATE_EVENT(T1);
        T1.CR1 = TIM_CR1(OPM, CEN); // Start timer in one-pulse mode
        return;
    }
    send_command_n(pulses, slots);
}

/**
 * @brief Schedule a single-slot write of one raw bit (encodes 0/1 to a pulse)
 * @param[in] bit Bit value to write (0 or 1)
 */
static void ds18b20_bus_write_bit(uint8_t bit) {
    uint8_t pulse = bit ? (uint8_t)ONE_PULSE : (uint8_t)ZERO_PULSE;
    ds18b20_bus_write_slots(&pulse, 1);
}

/**
 * @brief Schedule a two-slot read for the Search ROM id/cmp bit pair
 * @note Non-blocking: captures both slot timings into ctx.edge via DMA.
 *       Read the decoded bits with ds18b20_bus_pair_id()/cmp() once
 *       ds18b20_bus_done() reports completion.
 */
static void ds18b20_bus_read_pair(void) {
    // Configure timer for a two-slot read (id_bit, cmp_bit)
    T1.RCR = 1; // Two read slots, then a single update event
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND; // Total bit slot time
    T1.CCR1 = ONE_PULSE; // Read pulse duration (ONE_PULSE µs)
    // Configure channel 1 for output compare (generate read pulse)
    // Configure channel 2 for input capture (measure return pulse durations)
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2, OC1PE, CC2S_1, IC2F_0, IC2F_1, IC2F_2);
    T1.CCER = TIM_CCER(CC1E, CC2E); // Enable both channels
    T1.DIER = TIM_DIER(CC2DE); // Enable DMA request on capture
    FORCE_UPDATE_EVENT(T1);
    T1.CCR1 = 0; // Clear output compare value
    // Configure DMA to capture both slot timings into the edge buffer
    D13.CCR = 0; // Clear DMA configuration
    D13.CPAR = (uint32_t)&T1.CCR2; // DMA source: capture register
    D13.CMAR = (uint32_t)ctx.edge; // DMA destination: edge timestamp buffer
    D13.CNDTR = 2; // Number of transfers (id_bit, cmp_bit)
    D13.CCR = DMA_CCR(MINC, PSIZE_0, MSIZE_0, EN); // Enable DMA with memory increment
    T1.CR1 = TIM_CR1(OPM, CEN); // Start timer in one-pulse mode
}

/**
 * @brief Decode the id-bit of the last ds18b20_bus_read_pair()
 * @return Bit value (0 or 1)
 */
static uint8_t ds18b20_bus_pair_id(void) {
    return (ctx.edge[0] <= SHORT_PULSE_MAX) ? 1u : 0u;
}

/**
 * @brief Decode the cmp-bit of the last ds18b20_bus_read_pair()
 * @return Bit value (0 or 1)
 */
static uint8_t ds18b20_bus_pair_cmp(void) {
    return (ctx.edge[1] <= SHORT_PULSE_MAX) ? 1u : 0u;
}

/**
 * @}
 */

/**
 * @defgroup DS18B20_LowLevel DS18B20 Low-Level Blocking 1-Wire Primitives
 * @brief Blocking primitives for custom 1-Wire protocols. They busy-wait on
 *        hardware completion and MUST NOT be called while ds18b20_poll() or
 *        the device search is active. After using them, call ds18b20_restore()
 *        before returning to the non-blocking state machine.
 * @{
 */

/**
 * @brief Wait for the timer to finish its current one-shot operation
 * @note Busy-waits on the update flag. Used only by the low-level primitives.
 */
static void wait_timer_done(void) {
    __DSB();
    while (!(T1.SR & TIM_SR(UIF))) {
    }
    T1.SR = 0;
}

/**
 * @brief Perform a blocking 1-Wire reset and check for a presence pulse
 * @return 1 if at least one device answered the reset, 0 otherwise
 */
uint8_t ds18b20_reset(void) {
    reset_bus();
    wait_timer_done();
    return check_presence();
}

/**
 * @brief Write one bit to the 1-Wire bus as a single hardware-timed slot
 * @param[in] bit 1 = short low pulse (~5µs), 0 = long low pulse (~60µs)
 * @note Blocking: waits for the slot to finish before returning.
 */
void ds18b20_write_bit(uint8_t bit) {
    T1.RCR = 0; // Single slot, no repetition
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND; // Total bit slot time
    T1.CCR1 = bit ? ONE_PULSE : ZERO_PULSE; // Pulse duration encodes the bit
    // Configure channel 1 for output compare (drive bus low during the pulse)
    T1.CCMR1 = TIM_CCMR1(OC1M_0, OC1M_1, OC1M_2);
    T1.CCER = TIM_CCER(CC1E); // Enable output compare
    T1.DIER = 0; // No DMA for a single bit slot
    FORCE_UPDATE_EVENT(T1);
    T1.CR1 = TIM_CR1(OPM, CEN); // Start timer in one-pulse mode
    wait_timer_done();
}

/**
 * @brief Write one byte to the 1-Wire bus, LSB first
 * @param[in] byte Byte value to transmit
 * @note Blocking: 8 sequential single-slot writes, waits between slots.
 */
void ds18b20_write_byte(uint8_t byte) {
    for (uint8_t i = 0; i < DS18B20_BITS_PER_BYTE; i++) {
        ds18b20_write_bit((byte >> i) & 0x01);
    }
}

/**
 * @brief Read one bit from the 1-Wire bus as a single hardware-timed slot
 * @return The bit value read (0 or 1)
 * @note Blocking: waits for the slot to finish before returning.
 */
uint8_t ds18b20_read_bit(void) {
    volatile uint8_t sample = 0;
    T1.RCR = 0;
    T1.ARR = ONE_PULSE + ZERO_PULSE + GUARD_BAND;
    T1.CCR1 = ONE_PULSE;
    arm_capture((volatile void *)&sample, 1, 8);
    wait_timer_done();
    return (sample <= SHORT_PULSE_MAX) ? 1u : 0u;
}

/**
 * @brief Read one byte from the 1-Wire bus, LSB first
 * @return The byte value read
 * @note Blocking: 8 sequential single-slot reads, waits between slots.
 */
uint8_t ds18b20_read_byte(void) {
    uint8_t byte = 0;
    for (uint8_t i = 0; i < DS18B20_BITS_PER_BYTE; i++) {
        if (ds18b20_read_bit()) {
            byte |= (1u << i);
        }
    }
    return byte;
}

/**
 * @brief Restore the non-blocking state machine after using low-level primitives
 * @note Call this after finishing low-level operations and before starting
 *       ds18b20_poll(). It re-primes the state machine so the first poll()
 *       begins a measurement cycle.
 */
void ds18b20_restore(void) {
    T1.EGR = TIM_EGR(UG);
    __DSB();
}

/**
 * @}
 */

/**
 * @defgroup DS18B20_Search_Internal DS18B20 Internal Non-Blocking Device Search
 * @brief Maxim Search ROM (0xF0) state machine. The algorithm is inherently
 *        sequential: the direction bit written at position i determines which
 *        devices keep participating at position i+1, so the whole transaction
 *        cannot be batched into a single DMA pass like the fixed measurement
 *        sequence. Instead, the linear blocking loop is decomposed into a
 *        compact state machine with loop counters kept in the context
 *        (id_bit_number, last_discrepancy, ...). Each state performs exactly
 *        one hardware-timed operation via the internal bus primitives, so a
 *        poll call never blocks.
 * @{
 */

/** @brief Search state machine phases */
typedef enum {
    DS18B20_SEARCH_RESET, /**< reset scheduled; check presence, send 0xF0 */
    DS18B20_SEARCH_CMD, /**< 0xF0 sent; prepare first bit iteration */
    DS18B20_SEARCH_READ_PAIR, /**< id/cmp pair read; compute and write direction */
    DS18B20_SEARCH_WRITE_DIR, /**< direction written; advance bit counters */
    DS18B20_SEARCH_DONE /**< search finished; restore the driver state */
} search_phase_t;

