a5021/stm32-async-1wire/src/ds18b20.c
/**
 * @brief Non-blocking search context
 * @note Holds the loop counters of the search algorithm; the persistent pulse
 *       buffer (pulses) must stay valid across poll calls because the DMA
 *       feeds CCR1 from it asynchronously while the 0xF0 command is sent.
 */
typedef struct {
    search_phase_t phase; /**< Current phase of the search state machine */
    uint8_t rom[DS18B20_ROM_BYTES]; /**< ROM being assembled (bit by bit) */
    uint8_t pulses[DS18B20_BITS_PER_BYTE]; /**< Pulse buffer for the 0xF0 command */
    uint8_t id_bit_number; /**< Current bit position (1..64) */
    uint16_t last_discrepancy; /**< Last discrepancy point (Maxim algorithm) */
    uint16_t last_zero; /**< Last position where the '0' branch was taken */
    uint8_t found; /**< Number of DS18B20 devices found */
    uint8_t max; /**< Maximum number of devices to report */
    uint8_t finished; /**< 1 once the search has completed */
    ds18b20_search_sink_t sink; /**< Per-device callback */
} search_ctx_t;

/** @brief Global search context instance */
static search_ctx_t search_ctx;

/**
 * @brief Start a non-blocking device search
 * @param[in] sink Callback invoked per found DS18B20 device (may be NULL)
 * @param[in] max_devices Maximum number of devices to report (0 aborts)
 */
void ds18b20_search_start(ds18b20_search_sink_t sink, uint8_t max_devices) {
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        search_ctx.rom[i] = 0;
    }
    search_ctx.sink = sink;
    search_ctx.max = max_devices;
    search_ctx.found = 0;
    search_ctx.finished = 0;
    search_ctx.last_discrepancy = 0;
    if (max_devices == 0) {
        search_ctx.phase = DS18B20_SEARCH_DONE;
        return;
    }
    search_ctx.phase = DS18B20_SEARCH_RESET;
    ds18b20_bus_reset(); // Schedule the first hardware operation
}

/**
 * @brief Advance the non-blocking device search
 * @return 1 when the search is finished, 0 while still running
 */
uint8_t ds18b20_search_poll(void) {
    if (search_ctx.finished) {
        return 1;
    }

    if (search_ctx.phase == DS18B20_SEARCH_DONE) {
        // No hardware operation is pending at the end of the search: hand the
        // timer back to the measurement state machine exactly once.
        ds18b20_restore();
        search_ctx.finished = 1;
        return 1;
    }

    // Wait for the currently scheduled hardware operation to complete.
    // This is a non-blocking poll, not a busy-wait.
    if (!ds18b20_bus_done()) {
        return 0;
    }

    switch (search_ctx.phase) {
    case DS18B20_SEARCH_RESET:
        // Reset completed: a presence pulse means at least one device is on
        // the bus, so start a new search pass with the Search ROM command.
        if (!ds18b20_bus_present()) {
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        ds18b20_bus_encode_byte(search_ctx.pulses, DS18B20_SEARCH_ROM);
        ds18b20_bus_write_slots(search_ctx.pulses, DS18B20_BITS_PER_BYTE);
        search_ctx.phase = DS18B20_SEARCH_CMD;
        break;

    case DS18B20_SEARCH_CMD:
        // 0xF0 sent: prepare the first bit iteration and read the id/cmp pair.
        search_ctx.id_bit_number = 1;
        search_ctx.last_zero = 0;
        ds18b20_bus_read_pair();
        search_ctx.phase = DS18B20_SEARCH_READ_PAIR;
        break;

    case DS18B20_SEARCH_READ_PAIR: {
        const uint8_t byte_idx = (search_ctx.id_bit_number - 1) / DS18B20_BITS_PER_BYTE;
        const uint8_t mask = (uint8_t)(1u << ((search_ctx.id_bit_number - 1) % DS18B20_BITS_PER_BYTE));
        const uint8_t id_bit = ds18b20_bus_pair_id();
        const uint8_t cmp_bit = ds18b20_bus_pair_cmp();
        uint8_t direction;

        if (id_bit && cmp_bit) {
            // No device follows this path - search tree exhausted
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        if (id_bit != cmp_bit) {
            // Single device on this path - its bit fixes the direction
            direction = id_bit;
        } else if (search_ctx.id_bit_number < search_ctx.last_discrepancy) {
            // Follow the previously taken path
            direction = (search_ctx.rom[byte_idx] & mask) ? 1u : 0u;
            if (direction == 0) {
                // Remember the last 0-branch taken at a discrepancy
                search_ctx.last_zero = search_ctx.id_bit_number;
            }
        } else {
            // At the discrepancy point take the '1' branch first
            direction = (search_ctx.id_bit_number == search_ctx.last_discrepancy) ? 1u : 0u;
            if (direction == 0) {
                // Remember the last 0-branch taken at a discrepancy
                search_ctx.last_zero = search_ctx.id_bit_number;
            }
        }
        if (direction) {
            search_ctx.rom[byte_idx] |= mask;
        } else {
            search_ctx.rom[byte_idx] &= (uint8_t)~mask;
        }
        ds18b20_bus_write_bit(direction);
        search_ctx.phase = DS18B20_SEARCH_WRITE_DIR;
        break;
    }

    case DS18B20_SEARCH_WRITE_DIR:
        // Direction written: advance to the next bit or finish the device.
        search_ctx.id_bit_number++;
        if (search_ctx.id_bit_number <= DS18B20_ROM_BITS) {
            ds18b20_bus_read_pair();
            search_ctx.phase = DS18B20_SEARCH_READ_PAIR;
            break;
        }

        // All 64 bits of the current ROM assembled - validate it.
        search_ctx.last_discrepancy = search_ctx.last_zero;
        if (ds18b20_crc8(search_ctx.rom, DS18B20_ROM_BYTES) != 0) {
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        if (search_ctx.rom[0] == DS18B20_FAMILY_CODE) {
            search_ctx.found++;
            if (search_ctx.sink && search_ctx.sink(search_ctx.rom)) {
                search_ctx.phase = DS18B20_SEARCH_DONE;
                break;
            }
            if (search_ctx.found >= search_ctx.max) {
                search_ctx.phase = DS18B20_SEARCH_DONE;
                break;
            }
        }
        if (search_ctx.last_discrepancy == 0) {
            search_ctx.phase = DS18B20_SEARCH_DONE;
            break;
        }
        // Another device may exist - run another search pass.
        ds18b20_bus_reset();
        search_ctx.phase = DS18B20_SEARCH_RESET;
        break;

    default:
        break;
    }

