a5021/stm32-async-1wire/src/ds18b20.c
    return 0;
}

/**
 * @brief Number of DS18B20 devices found (valid once the search finished)
 * @return Count of found devices
 */
uint8_t ds18b20_search_count(void) { return search_ctx.found; }

/**
 * @}
 */

/**
 * @defgroup DS18B20_Public_Functions DS18B20 Public Functions
 * @{
 */

/**
 * @brief Initialize DS18B20 driver - configure clocks and peripherals
 */
void ds18b20_init(void) {
    // Enable clocks for required peripherals: GPIOA, TIM1, DMA1
    RC.APB2ENR |= RCC_APB2ENR(IOPAEN, TIM1EN);
    RC.AHBENR |= RCC_AHBENR(DMA1EN);
    // Configure timer prescaler for 1µs resolution (SYSCLK / 1000000 - 1)
    T1.PSC = TIM_PRESCALER;
    T1.EGR = TIM_EGR(UG);
    __DSB();
    T1.BDTR = TIM_BDTR(MOE);
    // Configure PA8 for 1-Wire communication (alternate function open drain)
    PA.CRH |= GPIO_CRH(CNF8_0, CNF8_1, MODE8_1);
}

/**
 * @brief Select which DS18B20 device to measure by its ROM address
 * @param[in] rom Pointer to the 8-byte ROM address (LSB first), or NULL to
 *                return to Skip ROM (broadcast) addressing
 * @note With a non-NULL address, the state machine sends Match ROM (0x55)
 *       plus the device address before each command, so only that device
 *       responds. Pass NULL (or a freshly initialised driver) to keep the
 *       legacy single-sensor Skip ROM behaviour. The address should come from
 *       the non-blocking device search (ds18b20_search_*).
 */
void ds18b20_select(const uint8_t* rom) {
    if (rom == 0) {
        ctx.address_mode = 0;
        return;
    }
    for (uint8_t i = 0; i < DS18B20_ROM_BYTES; i++) {
        ctx.selected_rom[i] = rom[i];
    }
    build_addr_prefix(); // Build the invariant Match ROM prefix once per selection
    ctx.address_mode = 1;
}

/**
 * @brief Check presence and issue command (shared by CONVERT and REQUEST states)
 * @param[in] cmd_byte Command byte to send
 * @param[in] skip_tbl Skip-ROM command table (for broadcast mode)
 * @param[in] next_state State to transition to on success
 */
static void issue_command(uint8_t cmd_byte, const uint8_t *skip_tbl, ds18b20_state_t next_state) {
    if (!check_presence()) {
        ds18b20_complete(DS18B20_TEMP_ERROR_NO_SENSOR);
        start_cycle_pause();
        ctx.current_state = DS18B20_ST_IDLE;
        return;
    }
    if (ctx.address_mode) {
        build_addr_cmd(cmd_byte);
        send_command_n(ctx.addr_cmd, DS18B20_MATCH_SLOTS);
    } else {
        send_command(skip_tbl);
    }
    ctx.current_state = next_state;
}

/**
 * @brief Main state machine function - must be called periodically from main loop
 * @note Non-blocking state machine that advances 1-Wire communication state
 * @note Uses timer update interrupt flag to determine when operations complete
 */
void ds18b20_poll(void) {

    // Check if timer update interrupt occurred (indicates operation completion)
    // This is the non-blocking way to detect when timed operations finish
    if (!(T1.SR & TIM_SR(UIF))) return;
    // Clear timer update interrupt flag
    T1.SR = 0;

    // State machine to manage 1-Wire communication sequence
    switch (ctx.current_state) {
    case DS18B20_ST_IDLE:
        // Initialize union memory (fills with 0xFF pattern)
        ctx.fill_union = (uint64_t)-1;
        // Transition to START state
        ctx.current_state = DS18B20_ST_START;
        /* fallthrough to START state immediately */
        __attribute__((fallthrough));

    case DS18B20_ST_START:
        // Turn on LED to indicate measurement in progress
        ds18b20_busy(!0);
        // Initiate 1-Wire bus reset sequence
        reset_bus();
        // Transition to CONVERT state
        ctx.current_state = DS18B20_ST_CONVERT;
        break;

    case DS18B20_ST_CONVERT:
        issue_command(DS18B20_CONVERT_T, conv_cmd, DS18B20_ST_WAIT);
        break;

    case DS18B20_ST_WAIT:
        // Start timer for conversion wait period (750ms typical)
        wait_conversion();
        ctx.current_state = DS18B20_ST_CONTINUE;
        break;

    case DS18B20_ST_CONTINUE:
        // Initiate second 1-Wire bus reset sequence
        reset_bus();
        ctx.current_state = DS18B20_ST_REQUEST;
        break;

    case DS18B20_ST_REQUEST:
        issue_command(DS18B20_READ_SCRATCHPAD, read_cmd, DS18B20_ST_READ);
        break;

    case DS18B20_ST_READ:
        // Initiate scratchpad data read using timer capture and DMA
        read_data();
        // Transition to DECODE state
        ctx.current_state = DS18B20_ST_DECODE;
        break;

    case 7: // DECODE - Process received data and report temperature
        // Decode captured pulse durations into scratchpad bytes
        decode_scratchpad();
        // Turn off LED to indicate measurement complete
        ds18b20_busy(0);

        // Validate reserved bytes per DS18B20 specification:
        // Byte 5 must be 0xFF, Byte 7 must be 0x10.
        // This catches all-zero, all-0xFF, and bus fault conditions.
        if (ctx.scratchpad[5] != 0xFF || ctx.scratchpad[7] != 0x10) {
            ds18b20_complete(DS18B20_TEMP_ERROR_CRC_FAIL);
            start_cycle_pause();
            ctx.current_state = 0;
            break;
        }

        // Validate CRC and report temperature or error
        if (ctx.scratchpad[DS18B20_SCRATCHPAD_LEN - 1] == check_scratchpad_crc()) {
            // CRC valid - decode and report temperature
            ds18b20_complete(decode_temperature());
        } else {
            // CRC invalid - report error
            ds18b20_complete(DS18B20_TEMP_ERROR_CRC_FAIL);
        }

        // Start inter-measurement pause period
        start_cycle_pause();
        // Return to IDLE state for next measurement cycle
        ctx.current_state = 0;
        break;

    default:
        // Unexpected state - report generic error
        ds18b20_complete(DS18B20_TEMP_ERROR_GENERIC);
        // Return to IDLE state
        ctx.current_state = 0;
        break;
    }
}

/**
 * @}
 */
